spec/support/vcr_cassettes/bgs/vnp_benefit_claim/create.yml

---
http_interactions:
- request:
    method: get
    uri: <BGS_BASE_URL>/VnpBnftClaimWebServiceBean/VnpBnftClaimService?WSDL
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Host:
      - ".vba.va.gov"
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Mon, 20 Jul 2020 22:43:42 GMT
      Server:
      - Apache
      X-Frame-Options:
      - SAMEORIGIN
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml;charset=utf-8
    body:
      encoding: UTF-8
      string: |-
        <?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.3.0-b170407.2038 svn-revision#2eaca54d17a59d265c6fe886b7fd0027836c766c. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.3.0-b170407.2038 svn-revision#2eaca54d17a59d265c6fe886b7fd0027836c766c. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://bnftClaimService.services.vonapp.vba.va.gov/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://bnftClaimService.services.vonapp.vba.va.gov/" name="VnpBnftClaimService">
        <types>
        <xsd:schema>
        <xsd:import namespace="http://bnftClaimService.services.vonapp.vba.va.gov/" schemaLocation="http://linktestbepbenefits.vba.va.gov:80/VnpBnftClaimWebServiceBean/VnpBnftClaimService?xsd=1"/>
        </xsd:schema>
        </types>
        <message name="vnpBnftClaimUpdate">
        <part name="parameters" element="tns:vnpBnftClaimUpdate"/>
        </message>
        <message name="vnpBnftClaimUpdateResponse">
        <part name="parameters" element="tns:vnpBnftClaimUpdateResponse"/>
        </message>
        <message name="MessageFaultException">
        <part name="fault" element="tns:MessageFaultException"/>
        </message>
        <message name="findAllAsArray">
        <part name="parameters" element="tns:findAllAsArray"/>
        </message>
        <message name="findAllAsArrayResponse">
        <part name="parameters" element="tns:findAllAsArrayResponse"/>
        </message>
        <message name="vnpBnftClaimCreate">
        <part name="parameters" element="tns:vnpBnftClaimCreate"/>
        </message>
        <message name="vnpBnftClaimCreateResponse">
        <part name="parameters" element="tns:vnpBnftClaimCreateResponse"/>
        </message>
        <message name="vnpBnftClaimFindByPrimaryKey">
        <part name="parameters" element="tns:vnpBnftClaimFindByPrimaryKey"/>
        </message>
        <message name="vnpBnftClaimFindByPrimaryKeyResponse">
        <part name="parameters" element="tns:vnpBnftClaimFindByPrimaryKeyResponse"/>
        </message>
        <message name="vnpBnftClaimRemove">
        <part name="parameters" element="tns:vnpBnftClaimRemove"/>
        </message>
        <message name="vnpBnftClaimRemoveResponse">
        <part name="parameters" element="tns:vnpBnftClaimRemoveResponse"/>
        </message>
        <portType name="VnpBnftClaimService">
        <operation name="vnpBnftClaimUpdate">
        <input wsam:Action="http://bnftClaimService.services.vonapp.vba.va.gov/VnpBnftClaimService/vnpBnftClaimUpdateRequest" message="tns:vnpBnftClaimUpdate"/>
        <output wsam:Action="http://bnftClaimService.services.vonapp.vba.va.gov/VnpBnftClaimService/vnpBnftClaimUpdateResponse" message="tns:vnpBnftClaimUpdateResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException" wsam:Action="http://bnftClaimService.services.vonapp.vba.va.gov/VnpBnftClaimService/vnpBnftClaimUpdate/Fault/MessageFaultException"/>
        </operation>
        <operation name="findAllAsArray">
        <input wsam:Action="http://bnftClaimService.services.vonapp.vba.va.gov/VnpBnftClaimService/findAllAsArrayRequest" message="tns:findAllAsArray"/>
        <output wsam:Action="http://bnftClaimService.services.vonapp.vba.va.gov/VnpBnftClaimService/findAllAsArrayResponse" message="tns:findAllAsArrayResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException" wsam:Action="http://bnftClaimService.services.vonapp.vba.va.gov/VnpBnftClaimService/findAllAsArray/Fault/MessageFaultException"/>
        </operation>
        <operation name="vnpBnftClaimCreate">
        <input wsam:Action="http://bnftClaimService.services.vonapp.vba.va.gov/VnpBnftClaimService/vnpBnftClaimCreateRequest" message="tns:vnpBnftClaimCreate"/>
        <output wsam:Action="http://bnftClaimService.services.vonapp.vba.va.gov/VnpBnftClaimService/vnpBnftClaimCreateResponse" message="tns:vnpBnftClaimCreateResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException" wsam:Action="http://bnftClaimService.services.vonapp.vba.va.gov/VnpBnftClaimService/vnpBnftClaimCreate/Fault/MessageFaultException"/>
        </operation>
        <operation name="vnpBnftClaimFindByPrimaryKey">
        <input wsam:Action="http://bnftClaimService.services.vonapp.vba.va.gov/VnpBnftClaimService/vnpBnftClaimFindByPrimaryKeyRequest" message="tns:vnpBnftClaimFindByPrimaryKey"/>
        <output wsam:Action="http://bnftClaimService.services.vonapp.vba.va.gov/VnpBnftClaimService/vnpBnftClaimFindByPrimaryKeyResponse" message="tns:vnpBnftClaimFindByPrimaryKeyResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException" wsam:Action="http://bnftClaimService.services.vonapp.vba.va.gov/VnpBnftClaimService/vnpBnftClaimFindByPrimaryKey/Fault/MessageFaultException"/>
        </operation>
        <operation name="vnpBnftClaimRemove">
        <input wsam:Action="http://bnftClaimService.services.vonapp.vba.va.gov/VnpBnftClaimService/vnpBnftClaimRemoveRequest" message="tns:vnpBnftClaimRemove"/>
        <output wsam:Action="http://bnftClaimService.services.vonapp.vba.va.gov/VnpBnftClaimService/vnpBnftClaimRemoveResponse" message="tns:vnpBnftClaimRemoveResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException" wsam:Action="http://bnftClaimService.services.vonapp.vba.va.gov/VnpBnftClaimService/vnpBnftClaimRemove/Fault/MessageFaultException"/>
        </operation>
        </portType>
        <binding name="VnpBnftClaimServicePortBinding" type="tns:VnpBnftClaimService">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <operation name="vnpBnftClaimUpdate">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="findAllAsArray">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="vnpBnftClaimCreate">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="vnpBnftClaimFindByPrimaryKey">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="vnpBnftClaimRemove">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        </binding>
        <service name="VnpBnftClaimService">
        <port name="VnpBnftClaimServicePort" binding="tns:VnpBnftClaimServicePortBinding">
        <soap:address location="http://linktestbepbenefits.vba.va.gov:80/VnpBnftClaimWebServiceBean/VnpBnftClaimService"/>
        </port>
        </service>
        </definitions>
  recorded_at: Mon, 20 Jul 2020 22:43:42 GMT
- request:
    method: post
    uri: <BGS_BASE_URL>/VnpBnftClaimWebServiceBean/VnpBnftClaimService
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://bnftClaimService.services.vonapp.vba.va.gov/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
          <wsse:UsernameToken>
            <wsse:Username>VAgovAPI</wsse:Username>
          </wsse:UsernameToken>
          <vaws:VaServiceHeaders xmlns:vaws="http://vbawebservices.vba.va.gov/vawss">
            <vaws:CLIENT_MACHINE>10.0.0.149</vaws:CLIENT_MACHINE>
            <vaws:STN_ID>281</vaws:STN_ID>
            <vaws:applicationName>VAgovAPI</vaws:applicationName>
            <vaws:ExternalUid>33558416711330541</vaws:ExternalUid>
            <vaws:ExternalKey>abraham.lincoln@vets.gov</vaws:ExternalKey>
          </vaws:VaServiceHeaders>
        </wsse:Security>
        </env:Header><env:Body><tns:vnpBnftClaimCreate><arg0><claimRcvdDt>2020-07-20T22:43:41Z</claimRcvdDt><statusTypeCd>CURR</statusTypeCd><svcTypeCd>CP</svcTypeCd><pgmTypeCd>COMP</pgmTypeCd><bnftClaimTypeCd>130DPNEBNADJ</bnftClaimTypeCd><ptcpntClmantId>146189</ptcpntClmantId><claimJrsdtnLctnId>335</claimJrsdtnLctnId><intakeJrsdtnLctnId>335</intakeJrsdtnLctnId><ptcpntMailAddrsId>113372</ptcpntMailAddrsId><vnpPtcpntVetId>146189</vnpPtcpntVetId><atchmsInd>N</atchmsInd><jrnDt>2020-07-20T22:43:41Z</jrnDt><jrnLctnId>281</jrnLctnId><jrnStatusTypeCd>U</jrnStatusTypeCd><jrnUserId>VAgovAPI</jrnUserId><jrnObjId>VAgovAPI</jrnObjId><ssn>796043735</ssn><vnpProcID>3828033</vnpProcID></arg0></tns:vnpBnftClaimCreate></env:Body></env:Envelope>
    headers:
      Host:
      - ".vba.va.gov"
      Soapaction:
      - '"vnpBnftClaimCreate"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '1611'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Mon, 20 Jul 2020 22:43:43 GMT
      Server:
      - Apache
      X-Frame-Options:
      - SAMEORIGIN
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml; charset=utf-8
    body:
      encoding: UTF-8
      string: <?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><env:Header><work:WorkContext
        xmlns:work="http://oracle.com/weblogic/soap/workarea/">rO0ABXdKABR3ZWJsb2dpYy5hcHAudm5wLWVhcgAAANYAAAAjd2VibG9naWMud29ya2FyZWEuU3RyaW5nV29ya0NvbnRleHQABTIuMC44AAA=</work:WorkContext></env:Header><S:Body><ns0:vnpBnftClaimCreateResponse
        xmlns:ns0="http://bnftClaimService.services.vonapp.vba.va.gov/"><return><vnpBnftClaimId>425718</vnpBnftClaimId><atchmsInd>N</atchmsInd><bnftClaimTypeCd>130DPNEBNADJ</bnftClaimTypeCd><claimJrsdtnLctnId>335</claimJrsdtnLctnId><claimRcvdDt>2020-07-20T22:43:41Z</claimRcvdDt><intakeJrsdtnLctnId>335</intakeJrsdtnLctnId><jrnDt>2020-07-20T22:43:41Z</jrnDt><jrnLctnId>281</jrnLctnId><jrnObjId>VAgovAPI</jrnObjId><jrnStatusTypeCd>U</jrnStatusTypeCd><jrnUserId>VAgovAPI</jrnUserId><pgmTypeCd>COMP</pgmTypeCd><ptcpntClmantId>146189</ptcpntClmantId><statusTypeCd>CURR</statusTypeCd><svcTypeCd>CP</svcTypeCd><ptcpntMailAddrsId>113372</ptcpntMailAddrsId><vnpPtcpntVetId>146189</vnpPtcpntVetId><vnpProcID>3828033</vnpProcID></return></ns0:vnpBnftClaimCreateResponse></S:Body></S:Envelope>
  recorded_at: Mon, 20 Jul 2020 22:43:44 GMT
recorded_with: VCR 6.0.0
